<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>

  
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">

  
  <title>&#1060;&#1086;&#1082;&#1080;&#1085;&#1072; &#1058;&#1077;&#1086;&#1088;&#1080;&#1103; &#1075;&#1088;&#1072;&#1092;&#1086;&#1074;</title>
</head>


<body>

&#1058;&#1077;&#1086;&#1088;&#1080;&#1103; &#1075;&#1088;&#1072;&#1092;&#1086;&#1074;<br>

<br>

<br>

&#1042; &#1090;&#1077;&#1086;&#1088;&#1080;&#1080; &#1075;&#1088;&#1072;&#1092;&#1086;&#1074; &#1090;&#1086;&#1095;&#1082;&#1080; &#1080;&#1084;&#1077;&#1085;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1072;&#1084;&#1080; (&#1091;&#1079;&#1083;&#1072;&#1084;&#1080;), &#1072; &#1083;&#1080;&#1085;&#1080;&#1080; &ndash;
&#1088;&#1077;&#1073;&#1088;&#1072;&#1084;&#1080; (&#1076;&#1091;&#1075;&#1072;&#1084;&#1080;). &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1075;&#1088;&#1072;&#1092; &ndash; &#1101;&#1090;&#1086; &#1089;&#1086;&#1074;&#1086;&#1082;&#1091;&#1087;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;,
&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1105;&#1085;&#1085;&#1099;&#1093; &#1088;&#1077;&#1073;&#1088;&#1072;&#1084;&#1080;.<br>

<img style="width: 473px; height: 416px;" alt="" src="img.JPG"><br>

<br>

<br>

&#1050;&#1086;&#1075;&#1076;&#1072; &#1080;&#1079; &#1083;&#1102;&#1073;&#1086;&#1081; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1083;&#1102;&#1073;&#1072;&#1103; &#1076;&#1088;&#1091;&#1075;&#1072;&#1103; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1072;, &#1090;&#1086; &#1090;&#1072;&#1082;&#1086;&#1081; &#1075;&#1088;&#1072;&#1092;
&#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1089;&#1074;&#1103;&#1079;&#1085;&#1099;&#1084; &#1075;&#1088;&#1072;&#1092;&#1086;&#1084;. &#1045;&#1089;&#1083;&#1080; &#1078;&#1077; &#1075;&#1088;&#1072;&#1092; &#1089;&#1074;&#1103;&#1079;&#1085;&#1099;&#1081;, &#1085;&#1086;
&#1101;&#1090;&#1086; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#1085;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1090;&#1086;&#1075;&#1076;&#1072; &#1090;&#1072;&#1082;&#1086;&#1081; &#1075;&#1088;&#1072;&#1092; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;
&#1080;&#1083;&#1080; &#1086;&#1088;&#1075;&#1088;&#1072;&#1092;&#1086;&#1084;.<br>

<br>

&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &#1085;&#1077;&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081;: &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081;:<br>

&nbsp;&nbsp; &nbsp; &nbsp;<img style="width: 269px; height: 182px;" alt="" src="notorient.JPG"> &nbsp; &nbsp;<img style="width: 304px; height: 228px;" alt="" src="orient.JPG"> &nbsp; &nbsp; &nbsp; &nbsp;<br>

<br>

<br>

&#1043;&#1088;&#1072;&#1092; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1074;&#1103;&#1079;&#1085;&#1099;&#1084; &#1077;&#1089;&#1083;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1083;&#1102;&#1073;&#1099;&#1084;&#1080; &#1076;&#1074;&#1091;&#1084;&#1103; &#1077;&#1075;&#1086; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1072;&#1084;&#1080; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;. &#1042; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1075;&#1088;&#1072;&#1092; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1089;&#1074;&#1103;&#1079;&#1085;&#1099;&#1084;.<br>

<br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
&#1089;&#1074;&#1103;&#1079;&#1085;&#1099;&#1081;: &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
&nbsp; &nbsp; &nbsp;&#1085;&#1077;&#1089;&#1074;&#1103;&#1079;&#1085;&#1099;&#1081;:<br>

<img style="width: 244px; height: 172px;" alt="" src="connected.JPG"> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<img style="width: 223px; height: 204px;" alt="" src="notconnected.JPG"><br>
<br>
<br>
&#1057;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100;&#1102; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1088;&#1077;&#1073;&#1077;&#1088;, &#1074;&#1099;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1093; &#1080;&#1079; &#1101;&#1090;&#1086;&#1081; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099;.<br>
<img style="width: 386px; height: 277px;" alt="" src="vertexdegree.JPG"><br>
&#1044;&#1077;&#1088;&#1077;&#1074;&#1086; - &#1101;&#1090;&#1086; &#1075;&#1088;&#1072;&#1092;, &#1084;&#1077;&#1078;&#1076;&#1091; &#1083;&#1102;&#1073;&#1099;&#1084;&#1080; &#1076;&#1074;&#1091;&#1084;&#1103; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1072;&#1084;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1088;&#1086;&#1074;&#1085;&#1086; &#1086;&#1076;&#1080;&#1085; &#1087;&#1091;&#1090;&#1100;.<br>
<img style="width: 347px; height: 424px;" alt="" src="tree.JPG"><br>
<br>
<br>
&#1045;&#1089;&#1083;&#1080; &#1075;&#1088;&#1072;&#1092;&#1099; G1 &#1080; G2 &#1080;&#1079;&#1086;&#1084;&#1086;&#1088;&#1092;&#1085;&#1099;, &#1090;&#1086; &#1086;&#1085;&#1080; &#1080;&#1084;&#1077;&#1102;&#1090; &#1086;&#1076;&#1085;&#1086; &#1080; &#1090;&#1086; &#1078;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085; &#1080; &#1076;&#1083;&#1103; &#1083;&#1102;&#1073;&#1099;&#1093; &#1076;&#1074;&#1091;&#1093; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085; &#1075;&#1088;&#1072;&#1092;&#1072; G1, <br>
&#1089;&#1082;&#1072;&#1078;&#1077;&#1084; B1 &#1080; C1, &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; &#1088;&#1077;&#1073;&#1088;&#1086;&#1084;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1080;&#1084; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099; B2 &#1080; C2 &#1075;&#1088;&#1072;&#1092;&#1072; G2 &#1090;&#1086;&#1078;&#1077; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1099; &#1088;&#1077;&#1073;&#1088;&#1086;&#1084;, <br>
&#1080; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;.<br>
<img style="width: 652px; height: 330px;" alt="" src="isomorph.JPG"><br>
<br>
<br>
&#1069;&#1081;&#1083;&#1077;&#1088;&#1086;&#1074; &#1094;&#1080;&#1082;&#1083; - &#1079;&#1072;&#1084;&#1082;&#1085;&#1091;&#1090;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1080;&#1090; &#1095;&#1077;&#1088;&#1077;&#1079; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1088;&#1077;&#1073;&#1088;&#1086; &#1075;&#1088;&#1072;&#1092;&#1072; &#1088;&#1086;&#1074;&#1085;&#1086; &#1087;&#1086; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1088;&#1072;&#1079;&#1091;.<br>
<img style="width: 420px; height: 313px;" alt="" src="eilcycle.JPG"><br>
<br>
<br>
<br>

</body>
</html>
